{
    "Data": {
        "Objectives": [
            {
                "Type": "statemachine",
                "Id": "738ad4b0-8e25-468d-9bfa-cd9a46fbfe85",
                "BriefingText": {
                    "$loc": {
                        "key": "UI_CONTRACT_GENERAL_OBJ_KILL",
                        "data": "$($repository 0fee1154-c66b-41e1-b504-897374cfdaff).Name"
                    }
                },
                "HUDTemplate": {
                    "display": {
                        "$loc": {
                            "key": "UI_CONTRACT_GENERAL_OBJ_KILL",
                            "data": "$($repository 0fee1154-c66b-41e1-b504-897374cfdaff).Name"
                        }
                    }
                },
                "Category": "primary",
                "Definition": {
                    "Scope": "Hit",
                    "Context": {
                        "Targets": [
                            "0fee1154-c66b-41e1-b504-897374cfdaff"
                        ]
                    },
                    "States": {
                        "Start": {
                            "Kill": [
                                {
                                    "Condition": {
                                        "$eq": [
                                            "$Value.RepositoryId",
                                            "0fee1154-c66b-41e1-b504-897374cfdaff"
                                        ]
                                    },
                                    "Transition": "Success"
                                }
                            ]
                        }
                    }
                },
                "TargetConditions": [
                    {
                        "Type": "killmethod_specificitem",
                        "RepositoryId": "4fad7437-59e9-4ca9-9b31-a6d97484216b",
                        "HardCondition": false,
                        "ObjectiveId": "780c8a14-a1ab-4e90-80d6-7277fd556f4a",
                        "KillMethod": "throw"
                    }
                ]
            },
            {
                "Type": "statemachine",
                "Id": "780c8a14-a1ab-4e90-80d6-7277fd556f4a",
                "Category": "secondary",
                "Definition": {
                    "Scope": "Hit",
                    "Context": {
                        "Targets": [
                            "0fee1154-c66b-41e1-b504-897374cfdaff"
                        ]
                    },
                    "States": {
                        "Start": {
                            "Kill": [
                                {
                                    "Condition": {
                                        "$and": [
                                            {
                                                "$and": [
                                                    {
                                                        "$eq": [
                                                            "$Value.RepositoryId",
                                                            "0fee1154-c66b-41e1-b504-897374cfdaff"
                                                        ]
                                                    },
                                                    {
                                                        "$any": {
                                                            "?": {
                                                                "$eq": [
                                                                    "$.#",
                                                                    "throw"
                                                                ]
                                                            },
                                                            "in": [
                                                                "$Value.KillMethodBroad",
                                                                "$Value.KillMethodStrict"
                                                            ]
                                                        }
                                                    }
                                                ]
                                            },
                                            {
                                                "$eq": [
                                                    "$Value.KillItemRepositoryId",
                                                    "4fad7437-59e9-4ca9-9b31-a6d97484216b"
                                                ]
                                            }
                                        ]
                                    },
                                    "Transition": "Success"
                                },
                                {
                                    "Condition": {
                                        "$eq": [
                                            "$Value.RepositoryId",
                                            "0fee1154-c66b-41e1-b504-897374cfdaff"
                                        ]
                                    },
                                    "Transition": "Failure"
                                }
                            ]
                        }
                    }
                }
            }
        ],
        "GameChangers": [],
        "Bricks": [],
        "Entrances": [
            "0aec817c-738e-4381-bbd4-a13b5d1c6730",
            "b38a7610-5f7f-4fcb-ad09-c554c3544367",
            "3812ea57-e29c-42cb-b93a-ea2d3e6a6806",
            "5a60147f-9c85-4998-b70f-1441ee7ba9b1",
            "d4ec0c94-02b2-4aae-be9e-cbb5cc7d7e4a",
            "5314c86b-7173-412b-a0b5-b0d9af2da722",
            "feaf524e-f54d-4815-bb2b-afb8f1a39141",
            "0809cabd-20f1-4fd4-b4fc-9cdc86bdf7cf"
        ]
    },
    "Metadata": {
        "Title": "Your Die In April",
        "Description": "Hey, you! \r\rI mean, Dear Kousei,\r\rYou were just here, and now I’m writing you a letter, kinda weird, right?\r\rYou’re a mess, you know that? You’re meek, and a quitter, and neurotic.\r\rThe first time I ever saw you, I was five years old. It was at a recital for the piano school I went to back then. You marched out onto that stage, and then made us all laugh by knocking over the bench. You sat on that giant piano, and with the first note you played, the world became more colorful. It was like you found a deluxe box of crayons on the keys, and tossed them everywhere Suddenly, the girl next to me starts bawling her eyes out.\r\rAnd now you&#39;re gonna give it up? Like you never played in the first place? Hearing you that day changed my life, what do you think of that?\r\rSo I switched, then and there, no regrets.\r\rWhen I found out we were at the same middle school, I was thrilled! How was I actually supposed to meet you, though? Buy egg sandwiches every day ‘til you notice me? In the end, all I could do was watch you guys. You were friends, and I was some stranger. It wasn&#39;t my place to barge in, so I didn&#39;t.\r\rI had surgery as a little kid, but I&#39;ve never been totally well. After a bad fall in the seventh grade, I was in the hospital a bunch. Those hospitals stays got longer, bit by bit. I was hardly ever at school by then. Nobody said how sick I was exactly, but I knew it was bad.\r\rThen one night, I saw my mom and dad crying down in the lounge, when they thought I was asleep. That&#39;s when I knew I didn&#39;t have much time.\r\rI made a choice:\r\rI ran. And I didn&#39;t look back!\r\rI started living life exactly how I wanted, so I wouldn&#39;t be all mopey in heaven. Contacts are weird, but I tried &#39;em. Tried eating a whole cake by myself too, because why not? Music that used to boss me around? I played it my way!\r\rAnd then…I told one single lie.\r\rAre you ready for it? Here it comes: “Kaori likes Watari!”\r\rShocking, right? But I&#39;m glad I told it. After all, Kousei, that lie brought us together.\r\rPlease tell Watari I&#39;m sorry. Honestly though, I&#39;m sure he&#39;s moved on to some other girl by now. That&#39;s just who he is. When it comes to friends, he&#39;s a great guy, but romantically, I want someone sincere.\r\rAlso, please tell Tsubaki that I&#39;m sorry. It turns out I was just passing through. I didn&#39;t wanna leave a big mess behind, so I couldn&#39;t be totally be honest with her either. Think of it: “Hey Tsubaki, be a pal and introduce me to Arima, would ya?” That would have been a pretty messed up thing for me to ask for. I mean, everyone could tell that Tsubaki was crazy about you. Even before we were friends, I knew. The only ones who didn&#39;t get the memo were you and her.\r\rWhen my lie finally brought the two of us together, you were different than I&#39;d imagined: stubborn, and passive, and pessimistic. Not to mention the fact that you stole my leggings. Your voice was lower than I thought. You were a guy, you know? And you were gentle, no surprise there.\r\rRemember when we jumped off that bridge? The river water felt amazing. And the moon shining down at the music room, like we could grab it on our tiptoes? When we raced that train, I really thought we could win! Singing “Twinkle Twinkle Little Star” with you late at night felt kinda perfect. Being at school after dark, it&#39;s mysterious, right? And snow, it looks like cherry blossom petals!\r\rYou must think I&#39;m silly, finding wonder in the everyday things around us, things I saw with you.\r\rIsn&#39;t it funny how the most unforgettable scenes can be so trivial, and vice versa?\r\rSo what&#39;s the verdict?\r\rWas I able to live inside someone&#39;s heart?\r\rAnd this heart, it wouldn&#39;t happen to be yours, would it?\r\rDo you think that…you&#39;ll remember me a little from time to time?\r\rNo hitting the reset button!\r\rDon&#39;t you forget me, that&#39;s a promise, okay?\r\rI&#39;m glad we found each other.\r\rWill I reach you?\r\rI hope I can.\r\rHere&#39;s the truth, Kousei:\r\rI love you!\r\rI love you!\r\rI love you!\r\rSorry that I never ate those canelés, and that I beat you up so much. I was such a brat to you. I&#39;m sorry for…everything.\r\rThank you.\r\r\r\r\r\rP.S. I&#39;m giving you one of my favorite pictures. You don&#39;t have to keep it, but I hope you do.",
        "ScenePath": "assembly:/_pro/scenes/missions/Ancestral/scene_bulldog.entity",
        "Location": "LOCATION_ANCESTRAL_BULLDOG",
        "IsPublished": true,
        "CreatorUserId": "be254851-1548-4b42-a945-dcafd3137683",
        "GameVersion": "8.11.0.52",
        "ServerVersion": "8.11.0.52",
        "Type": "usercreated",
        "Id": "024e87f7-4954-440a-8c62-75931fd2ceca",
        "PublicId": "128111871305",
        "TileImage": "$($repository 0fee1154-c66b-41e1-b504-897374cfdaff).Image",
        "GroupObjectiveDisplayOrder": [
            {
                "Id": "738ad4b0-8e25-468d-9bfa-cd9a46fbfe85"
            },
            {
                "Id": "780c8a14-a1ab-4e90-80d6-7277fd556f4a"
            }
        ],
        "CreationTimestamp": "2023-04-05T13:51:33.1177498Z",
        "Entitlements": [
            "LOCATION_ANCESTRAL"
        ]
    },
    "UserData": {}
}